<a href="https://colab.research.google.com/github/Nyawira12/hello-world-1/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2020_07_Lilian_Kibathi_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Loading and Importing Data

This section will import the data and display the first few rows of information.

In [44]:
import numpy as np
import pandas as pd
import datetime as datetime

In [ ]:
CDR_Descp = 'CDR_description.xlsx'
CDR = pd.read_excel(CDR_Descp)
CDR.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [ ]:
Cells_geo = pd.read_csv('cells_geo.csv', header = 0, index_col=0, delimiter=';')
Cells_geo.head()

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

In [ ]:
Geo_desc = pd.read_excel('cells_geo_description.xlsx')
Geo_desc.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [ ]:
Telcom_ds1 = pd.read_csv('Telcom_dataset.csv')
Telcom_ds1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
Telcom_ds2 = pd.read_csv('Telcom_dataset2.csv')
Telcom_ds2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
Telcom_ds3 = pd.read_csv('Telcom_dataset3.csv')
Telcom_ds3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

# Data Interpretation

This section will explore which type of information each data set contains for better manipulation

In [ ]:
CDR.columns

Index(['Column name', 'Description', 'Format'], dtype='object')

In [ ]:
Cells_geo.columns

Index(['VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE', 'ZONENAME',
       'LONGITUDE', 'LATITUDE', 'REGION', 'AREA', 'CELL_ID', 'SITE_CODE'],
      dtype='object')

In [ ]:
Geo_desc.columns

Index(['Column name', 'Description', 'Format'], dtype='object')

In [ ]:
Telcom_ds1.columns

Index(['PRODUTC', 'VALUE', 'DATETIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [ ]:
Telcom_ds2.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER',
       'DW_B_NUMBER', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [ ]:
Telcom_ds3.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELLID', 'SIET_ID'],
      dtype='object')

In [ ]:
CDR.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Column name  10 non-null     object
 1   Description  10 non-null     object
 2   Format       10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [ ]:
Cells_geo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3974 entries, 0 to 3973
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        3974 non-null   object
 1   STATUS        3907 non-null   object
 2   LOCALISATION  3974 non-null   object
 3   DECOUPZONE    3974 non-null   object
 4   ZONENAME      3968 non-null   object
 5   LONGITUDE     3974 non-null   float64
 6   LATITUDE      3974 non-null   float64
 7   REGION        3974 non-null   object
 8   AREA          3951 non-null   object
 9   CELL_ID       3974 non-null   object
 10  SITE_CODE     3974 non-null   object
dtypes: float64(2), object(9)
memory usage: 372.6+ KB

In [ ]:
Geo_desc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Column name  11 non-null     object
 1   Description  11 non-null     object
 2   Format       11 non-null     object
dtypes: object(3)
memory usage: 392.0+ bytes

In [ ]:
Telcom_ds1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUTC          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATETIME         5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELL_ID          5001 non-null   object
 9   SITE_ID          4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [ ]:
Telcom_ds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       5001 non-null   object
 1   VALUE         5001 non-null   int64
 2   DATE_TIME     5001 non-null   object
 3   CELL_ON_SITE  5001 non-null   object
 4   DW_A_NUMBER   5001 non-null   object
 5   DW_B_NUMBER   5001 non-null   object
 6   COUNTRY_A     5001 non-null   object
 7   COUNTRY_B     5001 non-null   object
 8   CELL_ID       5001 non-null   object
 9   SITE_ID       4325 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [ ]:
Telcom_ds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATE_TIME        5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELLID           5001 non-null   object
 9   SIET_ID          4396 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

# Data Manipulation and Cleaning

This section will find merge the data on common keys before cleaning for analysis

In [ ]:
Cells_geo.columns = map(str.lower, Cells_geo.columns)
Cells_geo.columns

Index(['villes', 'status', 'localisation', 'decoupzone', 'zonename',
       'longitude', 'latitude', 'region', 'area', 'cell_id', 'site_code'],
      dtype='object')

In [ ]:
Telcom_ds1.columns = map(str.lower, Telcom_ds1.columns)
columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number_int','dw_b_number_int', 
           'country_a', 'country_b', 'cell_id', 'site_id']
Telcom_ds1.columns = columns
Telcom_ds1.columns

Index(['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number_int',
       'dw_b_number_int', 'country_a', 'country_b', 'cell_id', 'site_id'],
      dtype='object')

In [ ]:
Telcom_ds2.columns = map(str.lower, Telcom_ds2.columns)
columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number','dw_b_number', 
           'country_a', 'country_b', 'cell_id', 'site_id']
Telcom_ds2.columns = columns
Telcom_ds2.columns

Index(['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number',
       'dw_b_number', 'country_a', 'country_b', 'cell_id', 'site_id'],
      dtype='object')

In [ ]:
Telcom_ds3.columns = map(str.lower, Telcom_ds3.columns)
columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number_int','dw_b_number_int', 
           'country_a', 'country_b', 'cell_id', 'site_id']
Telcom_ds3.columns = columns
Telcom_ds3.columns

Index(['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number_int',
       'dw_b_number_int', 'country_a', 'country_b', 'cell_id', 'site_id'],
      dtype='object')

In [33]:
Dfrm1 = pd.concat((Telcom_ds1, Telcom_ds2), axis=0, ignore_index=True)
Dfrm1.head()

  product  value              date_time  ...     site_id dw_a_number dw_b_number
0   Voice      0  2012-05-06 23:04:37.0  ...  /TJNe+Mmtu         NaN         NaN
1     sms      0  2012-05-06 23:05:25.0  ...  /+cKZKIp41         NaN         NaN
2     sms     25  2012-05-06 23:05:41.0  ...  /u0FSD+ahi         NaN         NaN
3   Voice     56  2012-05-06 23:05:42.0  ...  +cNeJzsTp3         NaN         NaN
4   Voice     14  2012-05-06 23:06:29.0  ...  051KhYDCpv         NaN         NaN

[5 rows x 12 columns]

In [34]:
DFrm2 = pd.concat([DFrm1, Telcom_ds3], axis=0, ignore_index=False)
Telcom_ds3.drop_duplicates(subset=['cell_id'], inplace=True)
DFrm2.head()

  product  value              date_time  ... region area site_code
0   Voice     61  2012-05-08 23:01:28.0  ...    NaN  NaN       NaN
1     sms      0  2012-05-08 23:01:31.0  ...    NaN  NaN       NaN
2   Voice     10  2012-05-08 23:02:59.0  ...    NaN  NaN       NaN
3     sms      0  2012-05-08 23:03:04.0  ...    NaN  NaN       NaN
4   Voice     22  2012-05-08 23:03:16.0  ...    NaN  NaN       NaN

[5 rows x 20 columns]

In [35]:
Telcom_Data = pd.concat([DFrm2, Cells_geo], axis=0, ignore_index=False)
Cells_geo.drop_duplicates(subset=['cell_id'], inplace=True)
Telcom_Data.head()

  product  value              date_time  ... region area site_code
0   Voice   61.0  2012-05-08 23:01:28.0  ...    NaN  NaN       NaN
1     sms    0.0  2012-05-08 23:01:31.0  ...    NaN  NaN       NaN
2   Voice   10.0  2012-05-08 23:02:59.0  ...    NaN  NaN       NaN
3     sms    0.0  2012-05-08 23:03:04.0  ...    NaN  NaN       NaN
4   Voice   22.0  2012-05-08 23:03:16.0  ...    NaN  NaN       NaN

[5 rows x 20 columns]

In [51]:
Telcom_Data.date_time = pd.to_datetime(Telcom_Data.datetime)

In [53]:
Telcom_Data['Date'] = Telcom_Data['date_time'].dt.date
Telcom_Data['Time'] = Telcom_Data['date_time'].dt.time

In [76]:
Telcom_Data.dropna(axis=1, how='all')
Telcom_Data.dropna(thresh=5)

     product  value           date_time  ...   site_code        Date      Time
0      Voice   61.0 2012-05-08 23:01:28  ...         NaN  2012-05-08  23:01:28
1        sms    0.0 2012-05-08 23:01:31  ...         NaN  2012-05-08  23:01:31
2      Voice   10.0 2012-05-08 23:02:59  ...         NaN  2012-05-08  23:02:59
3        sms    0.0 2012-05-08 23:03:04  ...         NaN  2012-05-08  23:03:04
4      Voice   22.0 2012-05-08 23:03:16  ...         NaN  2012-05-08  23:03:16
...      ...    ...                 ...  ...         ...         ...       ...
3969     NaN    NaN                 NaT  ...  f91ed8d2e9         NaT       NaT
3970     NaN    NaN                 NaT  ...  f91ed8d2e9         NaT       NaT
3971     NaN    NaN                 NaT  ...  61bee9c70c         NaT       NaT
3972     NaN    NaN                 NaT  ...  61bee9c70c         NaT       NaT
3973     NaN    NaN                 NaT  ...  61bee9c70c         NaT       NaT

[5512 rows x 22 columns]

# Data Analysis

This section will analyse the data to find a solution to the underlying research problem. This will be done by answering selected research questions

In [77]:
Telcom_Data.head()

  product  value           date_time  ... site_code        Date      Time
0   Voice   61.0 2012-05-08 23:01:28  ...       NaN  2012-05-08  23:01:28
1     sms    0.0 2012-05-08 23:01:31  ...       NaN  2012-05-08  23:01:31
2   Voice   10.0 2012-05-08 23:02:59  ...       NaN  2012-05-08  23:02:59
3     sms    0.0 2012-05-08 23:03:04  ...       NaN  2012-05-08  23:03:04
4   Voice   22.0 2012-05-08 23:03:16  ...       NaN  2012-05-08  23:03:16

[5 rows x 22 columns]

In [43]:
# Which were the most used cities in these three days?
Telcom_Data["villes"].value_counts()

COCODY         353
YOPOUGON       291
ABOBO          255
MARCORY        140
TREICHVILLE    132
              ...
MOAPE            3
KOTOULA          2
MEMNI            2
DANANON          1
OUANGOLO         1
Name: villes, Length: 504, dtype: int64

In [71]:
# Which cities were used most during home hours?
Busy_Cities = Telcom_Data['villes'], Telcom_Data['Time']
Busy_Cities

(0            NaN
 1            NaN
 2            NaN
 3            NaN
 4            NaN
           ...
 3969    ZUENOULA
 3970    ZUENOULA
 3971    ZUENOULA
 3972    ZUENOULA
 3973    ZUENOULA
 Name: villes, Length: 5512, dtype: object, 0       23:01:28
 1       23:01:31
 2       23:02:59
 3       23:03:04
 4       23:03:16
           ...
 3969         NaT
 3970         NaT
 3971         NaT
 3972         NaT
 3973         NaT
 Name: Time, Length: 5512, dtype: object)

In [74]:
Pop_products = Telcom_Data['product'], Telcom_Data['Time']
Telcom_Data['product'].count

<bound method Series.count of 0       Voice
1         sms
2       Voice
3         sms
4       Voice
        ...
3969      NaN
3970      NaN
3971      NaN
3972      NaN
3973      NaN
Name: product, Length: 5512, dtype: object>